Repository: guilamu/gravity-extract
Catalog: languages/gravity-extract-*.po
Languages: fr_fr

source: Gravity Extract requires Gravity Forms to be installed and activated.
fr_fr: Gravity Extract nécessite que Gravity Forms soit installé et activé.

source: Fetching models...
fr_fr: Récupération des modèles...

source: Select a model
fr_fr: Sélectionner un modèle

source: No image-capable models found
fr_fr: Aucun modèle compatible avec les images trouvé

source: Error fetching models
fr_fr: Erreur lors de la récupération des modèles

source: Select target field
fr_fr: Sélectionner le champ cible

source: No text/paragraph fields in form
fr_fr: Aucun champ texte/paragraphe dans le formulaire

source: Select a mapping profile above to configure field mappings.
fr_fr: Sélectionnez un profil de mappage ci-dessus pour configurer les correspondances.

source: — Not mapped —
fr_fr: — Non mappé —

source: Extracted Field
fr_fr: Champ extrait

source: Target Form Field
fr_fr: Champ de formulaire cible

source: Automap with AI ✨
fr_fr: Mapper automatiquement avec l'IA ✨

source: No extracted keys or form fields available to map.
fr_fr: Aucune clé extraite ou champ de formulaire disponible pour le mappage.

source: Successfully automapped %d fields!
fr_fr: %d champs mappés automatiquement avec succès !

source: AI could not find any confident matches.
fr_fr: L'IA n'a trouvé aucune correspondance fiable.

source: Error occurred during automapping.
fr_fr: Une erreur s'est produite lors du mappage automatique.

source: Request failed. Please try again.
fr_fr: La requête a échoué. Veuillez réessayer.

source: Uploading...
fr_fr: Téléversement en cours...

source: Analyzing document with AI...
fr_fr: Analyse du document avec l'IA...

source: Extraction complete!
fr_fr: Extraction terminée !

source: Error analyzing image
fr_fr: Erreur lors de l'analyse de l'image

source: Please upload an image file (JPEG, PNG, or WebP)
fr_fr: Veuillez téléverser une image (JPEG, PNG ou WebP)

source: Processing image...
fr_fr: Traitement de l'image...

source: File size exceeds 10MB limit
fr_fr: La taille du fichier dépasse la limite de 10 Mo

source: File upload failed. Please try again.
fr_fr: Échec du téléversement. Veuillez réessayer.

source: Field not configured
fr_fr: Champ non configuré

source: Accepted File Types
fr_fr: Types de fichiers acceptés

source: Only image files (JPEG, PNG, WebP) are accepted for AI analysis.
fr_fr: Seuls les fichiers image (JPEG, PNG, WebP) sont acceptés pour l'analyse IA.

source: Mapping Profile
fr_fr: Profil de mappage

source: Select a profile
fr_fr: Sélectionner un profil

source: Supplier Invoice (Purchases)
fr_fr: Facture fournisseur (Achats)

source: Sales invoice
fr_fr: Facture de vente

source: Credit note
fr_fr: Avoir

source: Generic receipt
fr_fr: Reçu générique

source: Restaurant / Hotel
fr_fr: Restaurant / Hôtel

source: Mileage Expenses (Route Maps)
fr_fr: Frais kilométriques (Cartes d'itinéraire)

source: Bank Details (RIB/Account ID)
fr_fr: Coordonnées bancaires (RIB)

source: Generic Document (Minimal)
fr_fr: Document générique (Minimal)

source: Field Mappings
fr_fr: Correspondances de champs

source: POE API Key
fr_fr: Clé API POE

source: Enter your POE API key to enable AI-powered document extraction. Get your key from poe.com.
fr_fr: Entrez votre clé API POE pour activer l'extraction de documents par IA. Obtenez votre clé sur poe.com.

source: AI Model
fr_fr: Modèle IA

source: Select the AI model to use for image analysis. Only models that support image input are shown.
fr_fr: Sélectionnez le modèle IA à utiliser pour l'analyse d'images. Seuls les modèles compatibles avec les images sont affichés.

source: Select the type of document to extract. Each profile defines which fields to extract from the document.
fr_fr: Sélectionnez le type de document à extraire. Chaque profil définit les champs à extraire du document.

source: Map each extracted value to a form field. The AI will extract data and populate the mapped fields.
fr_fr: Associez chaque valeur extraite à un champ de formulaire. L'IA extraira les données et remplira les champs correspondants.

source: Unauthorized
fr_fr: Non autorisé

source: API key is required
fr_fr: La clé API est requise

source: Missing required parameters
fr_fr: Paramètres requis manquants

source: Form not found
fr_fr: Formulaire non trouvé

source: Field not found
fr_fr: Champ non trouvé

source: Form not configured. Please set API Key and Model in Form Settings → Gravity Extract.
fr_fr: Formulaire non configuré. Veuillez définir la clé API et le modèle dans Paramètres du formulaire → Gravity Extract.

source: No mapping profile selected
fr_fr: Aucun profil de mappage sélectionné

source: No fields mapped for extraction
fr_fr: Aucun champ mappé pour l'extraction

source: No file uploaded
fr_fr: Aucun fichier téléversé

source: PDF conversion failed. Please try uploading an image instead.
fr_fr: Échec de la conversion PDF. Veuillez plutôt téléverser une image.

source: No mapping profile selected for analysis
fr_fr: Aucun profil de mappage sélectionné pour l'analyse

source: Failed to read uploaded file for analysis
fr_fr: Impossible de lire le fichier téléversé pour l'analyse

source: File uploaded and analyzed successfully
fr_fr: Fichier téléversé et analysé avec succès

source: Please configure API Key and Model in Form Settings → Gravity Extract first.
fr_fr: Veuillez d'abord configurer la clé API et le modèle dans Paramètres du formulaire → Gravity Extract.

source: No keys or fields provided to map
fr_fr: Aucune clé ou champ fourni pour le mappage

source: Gravity Extract Settings
fr_fr: Paramètres Gravity Extract

source: Configure the POE API credentials and AI model for document extraction in this form.
fr_fr: Configurez les identifiants API POE et le modèle IA pour l'extraction de documents dans ce formulaire.

source: Get your API key from poe.com
fr_fr: Obtenez votre clé API sur poe.com

source: Enter your POE API key for AI document analysis.
fr_fr: Entrez votre clé API POE pour l'analyse de documents par IA.

source: After saving the API key, refresh this page to load available AI models.
fr_fr: Après avoir enregistré la clé API, actualisez cette page pour charger les modèles IA disponibles.

source: Mapping Profiles
fr_fr: Profils de mappage

source: Create and manage custom document mapping profiles.
fr_fr: Créez et gérez des profils de mappage de documents personnalisés.

source: Manage Mapping Profiles
fr_fr: Gérer les profils de mappage

source: Select a model (save API key first)
fr_fr: Sélectionner un modèle (enregistrez d'abord la clé API)

source: Are you sure you want to delete this profile?
fr_fr: Êtes-vous sûr de vouloir supprimer ce profil ?

source: Enter profile name:
fr_fr: Entrez le nom du profil :

source: Enter new name for duplicate:
fr_fr: Entrez le nouveau nom pour le duplicata :

source: Profile saved successfully!
fr_fr: Profil enregistré avec succès !

source: Profile deleted successfully!
fr_fr: Profil supprimé avec succès !

source: Profile imported successfully!
fr_fr: Profil importé avec succès !

source: An error occurred. Please try again.
fr_fr: Une erreur s'est produite. Veuillez réessayer.

source: Please enable at least one field.
fr_fr: Veuillez activer au moins un champ.

source: Profile name is required.
fr_fr: Le nom du profil est requis.

source: Edit Profile
fr_fr: Modifier le profil

source: New Profile
fr_fr: Nouveau profil

source: No custom profiles yet. Click "New Profile" to create one.
fr_fr: Aucun profil personnalisé. Cliquez sur « Nouveau profil » pour en créer un.

source: field
fr_fr: champ

source: fields
fr_fr: champs

source: (Custom)
fr_fr: (Personnalisé)

source: Invalid JSON file
fr_fr: Fichier JSON invalide

source: Detection failed. Please try again.
fr_fr: Échec de la détection. Veuillez réessayer.

source: Fields detected!
fr_fr: Champs détectés !

source: No fields detected
fr_fr: Aucun champ détecté

source: Close
fr_fr: Fermer

source: Import
fr_fr: Importer

source: Back to List
fr_fr: Retour à la liste

source: Profile Name
fr_fr: Nom du profil

source: Enter profile name...
fr_fr: Entrez le nom du profil...

source: Detect available fields from sample
fr_fr: Détecter les champs disponibles à partir d'un exemple

source: Available Fields
fr_fr: Champs disponibles

source: Drag fields to the right to enable them
fr_fr: Faites glisser les champs vers la droite pour les activer

source: Enabled Fields
fr_fr: Champs activés

source: These fields will be extracted from documents
fr_fr: Ces champs seront extraits des documents

source: Save Profile
fr_fr: Enregistrer le profil

source: Custom Label:
fr_fr: Libellé personnalisé :

source: Cancel
fr_fr: Annuler

source: Max size: %s. Allowed types: %s
fr_fr: Taille max : %s. Types autorisés : %s

source: Drop your document image here
fr_fr: Déposez votre image de document ici

source: or click to browse
fr_fr: ou cliquez pour parcourir

source: Remove
fr_fr: Supprimer

source: View Image
fr_fr: Voir l'image

source: This field is required.
fr_fr: Ce champ est obligatoire.

source: Profile slug is required
fr_fr: L'identifiant du profil est requis

source: Profile not found
fr_fr: Profil non trouvé

source: Profile name is required
fr_fr: Le nom du profil est requis

source: At least one field must be enabled
fr_fr: Au moins un champ doit être activé

source: Profile saved successfully
fr_fr: Profil enregistré avec succès

source: Failed to save profile
fr_fr: Échec de l'enregistrement du profil

source: Profile deleted successfully
fr_fr: Profil supprimé avec succès

source: Failed to delete profile
fr_fr: Échec de la suppression du profil

source: New profile name is required
fr_fr: Le nouveau nom du profil est requis

source: Profile duplicated successfully
fr_fr: Profil dupliqué avec succès

source: Failed to duplicate profile
fr_fr: Échec de la duplication du profil

source: No import data provided
fr_fr: Aucune donnée d'importation fournie

source: Invalid profile format
fr_fr: Format de profil invalide

source: Profile imported successfully
fr_fr: Profil importé avec succès

source: Failed to import profile
fr_fr: Échec de l'importation du profil

source: Failed to read uploaded file
fr_fr: Impossible de lire le fichier téléversé

source: Detected %d fields from document
fr_fr: %d champs détectés dans le document

source: No fields detected from document
fr_fr: Aucun champ détecté dans le document

source: Model is required
fr_fr: Le modèle est requis

source: Image is required
fr_fr: L'image est requise

source: API returned status %d
fr_fr: L'API a renvoyé le statut %d

source: Failed to parse API response
fr_fr: Impossible d'analyser la réponse de l'API

source: Invalid API response
fr_fr: Réponse API invalide

source: AI model is required
fr_fr: Le modèle IA est requis

source: Image data is required
fr_fr: Les données d'image sont requises

source: No fields to extract
fr_fr: Aucun champ à extraire

source: Could not parse AI response
fr_fr: Impossible d'analyser la réponse de l'IA
